ci4/app/Models/IuranModel.php

SELECT *
FROM `iuran`
JOIN `warga` ON `warga`.`id` = `iuran`.`warga_id`
---
    public function getIuran($id = false)
    {
        if ($id === false) {
            return $this->table('iuran')
                ->join('warga', 'warga.id = iuran.warga_id')
                ->get()
                ->getResultArray();